app/views/questions/_form.html.erb

  <p>Course</p>
  <%= f.collection_select :course_id, Course.all, :id, :description %>
---
SELECT "courses".* FROM "courses"