app/views/questions/show.html.erb

		</tr>
		<% if @question.answers.count == 0 %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1