app/views/courses/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."course_id" = 1
---
		<ul>
		<% if @course.questions.count == 0 %>