app/controllers/answers_controller.rb

  def show
    @answer = current_user.answers.find(params[:id])
---
SELECT "answers".* FROM "answers" INNER JOIN "questions" ON "answers"."question_id" = "questions"."id" INNER JOIN "courses" ON "questions"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "answers"."id" = ? LIMIT 1  [["id", "48"]]

  def mark_correct
    answer = current_user.answers.find(params[:id])

    answer.correct = 1
    respond_to do |format|
      if answer.save
---
SELECT "answers".* FROM "answers" INNER JOIN "questions" ON "answers"."question_id" = "questions"."id" INNER JOIN "courses" ON "questions"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "answers"."id" = ? LIMIT 1  [["id", "86"]]
UPDATE "answers" SET "correct" = 1, "updated_at" = '2013-09-16 04:00:30.263396' WHERE "answers"."id" = 86

  def text_receipt
    answer = Answer.find(params[:id])

    if answer.update_text_receipt
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "answers" SET "text_receipt" = 1, "receipt_date" = '2013-09-14 20:02:59.362375', "updated_at" = '2013-09-14 20:02:59.363402' WHERE "answers"."id" = 11