app/controllers/courses_controller.rb

  def index
    @courses = current_user.courses.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1

  def show
    @courses = current_user.courses.all
    @course = current_user.courses.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1 AND "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @courses = current_user.courses.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1 AND "courses"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @course = current_user.courses.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("created_at", "description", "paused_flag", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 04:44:14 UTC +00:00], ["description", "Test Course"], ["paused_flag", 0], ["updated_at", Wed, 18 Sep 2013 04:44:14 UTC +00:00], ["user_id", 1]]

  def update
    @course = current_user.courses.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1 AND "courses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "courses" SET "paused_flag" = 1, "updated_at" = '2013-09-18 04:47:42.970607' WHERE "courses"."id" = 1

  def destroy
    @course = current_user.courses.find(params[:id])
    @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1 AND "courses"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 6]]