app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" INNER JOIN "courses" ON "questions"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "questions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @question = current_user.questions.find(params[:id])

SELECT "courses".* FROM "courses"
---
  def new
    @question = Question.new
    @courses = current_user.courses.all

INSERT INTO "questions" ("correct_answer", "course_id", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?, ?)  [["correct_answer", "42"], ["course_id", 2], ["created_at", Sat, 07 Sep 2013 16:06:35 UTC +00:00], ["question", "What is the meaning of life?"], ["updated_at", Sat, 07 Sep 2013 16:06:35 UTC +00:00]]
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save