app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings" INNER JOIN "courses" ON "settings"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "settings"."id" = ? LIMIT 1  [["id", "3"]]
---
	def show
		@setting = current_user.settings.find(params[:id])

SELECT "settings".* FROM "settings" INNER JOIN "courses" ON "settings"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "settings"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@setting = current_user.settings.find(params[:id])

SELECT "settings".* FROM "settings" INNER JOIN "courses" ON "settings"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "settings"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "settings" SET "texts_per_day" = 3, "start_time" = 15, "end_time" = 16, "paused_flag" = x'30', "updated_at" = '2013-09-15 21:13:54.515355' WHERE "settings"."id" = 1
---
	def update
		@setting = current_user.settings.find(params[:id])
		params[:settings][:paused_flag] ||= 0

		respond_to do |format|
			if @setting.update_attributes(params[:settings])