app/controllers/sms_controller.rb

	def receive
		sender = params[:From]
		body = params[:Body]

		user = User.find_by_phone_number(sender)

		if user.nil?
			render :action => 'no_user.xml', :layout => false
		end

		if !body.match(/[Qq][0-9]{1,}/).nil?
			answer_id = body.scan(/[Qq][0-9]{1,}/).first.scan(/[0-9]{1,}/).first.to_i

			@answer = user.answers.find(answer_id)
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = '+17202487155' LIMIT 1
SELECT "answers".* FROM "answers" INNER JOIN "questions" ON "answers"."question_id" = "questions"."id" INNER JOIN "courses" ON "questions"."course_id" = "courses"."id" WHERE "courses"."user_id" = 1 AND "answers"."id" = ? LIMIT 1  [["id", 48]]