app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "phone_number", "remember_token", "text_code", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "settings" ("created_at", "end_time", "paused_flag", "response_time", "start_time", "texts_per_day", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
        if @user.create_settings

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "last_name" = 'Meadowcroft', "phone_number" = '+1720-248-7155', "password_digest" = '$2a$10$m6rGZEJfnwtxTUliD8ORLOisVG6nK6EBo7MXHw1t3eLKmcwMCdG4i', "updated_at" = '2013-09-15 20:30:28.402901' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])